# MassZoneSpaceTypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassZoneSpaceTypeParam Property
ParameterTypeId Class See Also
---
"Space Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassZoneSpaceTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassZoneSpaceTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassZoneSpaceTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace